doc/2018-10-27-ICC/post-ICC.org
#+TITLE: Different types of ICC in R

#+BEGIN_SRC R :exports none :session *R* :cache no
path <- "~/Documents/GitHub/bozenne.github.io/doc/2018-10-27-ICC/"
path.figure <- file.path(path,"figures")
#+END_SRC


In this document, we will consider measurements done at several
sessions over several individuals. We assume no missing data, i.e.,
all individuals have measurements for all sessions. The question we
would like to answer is what is the reliability of the measurements?

#+BEGIN_EXPORT latex
\begingroup
\renewcommand{\section}[2]{}
\tableofcontents
\endgroup
#+END_EXPORT

\clearpage

Recommanded references: 
- Kenneth O. McGraw and S. P. Wong *Forming Inferences About Some Intraclass Correlation Coefficients*, Psychological Methods, 1996, Vol. l,No. 1,30-46
- Lawrence Lin, A.S. Hedayat, Wenting Wu, *Statistical Tools for Measuring Agreement*, 2012, Springer. 

\clearpage

* Preparation

#+LATEX: \lstset{style=code-tiny}

** Load R packages
#+BEGIN_SRC R :export code :results both :session *R* :cache no 
library(data.table)
library(lava)
library(lme4)
library(nlme)
library(irr)
library(psych)
#+END_SRC

#+RESULTS:
#+BEGIN_SRC R
irr
lpSolve
psych
lme4
Matrix
lava
mgcv
nlme
ggplot2
data.table
splines
stats
graphics
grDevices
utils
datasets
methods
base
#+END_SRC



** Data generation
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
n.id <- 10
n.scan <- 2
n.rater <- 5

set.seed(10)
m <- lvm(c(Ytest,Yretest) ~ 2*eta)
latent(m) <- ~eta
distribution(m, ~Ytest) <- lava::gaussian.lvm(mean = 1, sd = 1)
distribution(m, ~Yretest) <- lava::gaussian.lvm(mean = 1, sd = 1)

dtW.icc1 <- as.data.table(lava::sim(m, n.id))
dtW.icc1[, eta := NULL]
dtW.icc1[, Id := as.character(1:.N)]
dtL.icc1 <- melt(dtW.icc1, id.vars = "Id", value.name = "Y", variable.name = "session")

dfW.icc1 <- as.data.frame(dtW.icc1)
dfL.icc1 <- as.data.frame(dtL.icc1)

mm <- lvm(c(Y1,Y2,Y3,Y4,Y5) ~ 2*eta)
latent(mm) <- ~eta
distribution(mm, ~Y1) <- lava::gaussian.lvm(mean = 1, sd = 1)
distribution(mm, ~Y2) <- lava::gaussian.lvm(mean = 1, sd = 1)
distribution(mm, ~Y3) <- lava::gaussian.lvm(mean = 1, sd = 1)
distribution(mm, ~Y4) <- lava::gaussian.lvm(mean = 1, sd = 1)
distribution(mm, ~Y5) <- lava::gaussian.lvm(mean = 1, sd = 1)

dtW.icc2 <- as.data.table(lava::sim(mm, n.id))
dtW.icc2[, eta := NULL]
dtW.icc2[, Id := as.character(1:.N)]
dtL.icc2 <- melt(dtW.icc2, id.vars = "Id", value.name = "Y", variable.name = "session")

dfW.icc2 <- as.data.frame(dtW.icc2)
dfL.icc2 <- as.data.frame(dtL.icc2)
#+END_SRC


#+RESULTS:

\clearpage

* ICC1: fixed number of sessions assuming no session effect

Using ICC1, we assess the absolute agreement among measurements
repeated over one random factor (here patient identity) assuming no
other effect. The number of sessions is fixed meaning that it is
precisely those sessions that are interesting. 

\bigskip

/Example:/ we want to plan a study to assess treatment efficacy with
two sessions: baseline and post-treatment. EEG is used to measure
treatment efficacy. Prior to this study, another study is performed to
assessed the stability of the EEG measurement between two sessions. We
don't expect systematic difference in EEG signal between the sessions.

\bigskip

ICC1 is equivalent to the following mixed model:

#+BEGIN_EXPORT latex
\begin{equation}
 Y_{i,t} = \alpha + u_{i} + \varepsilon_{i,t} 
\end{equation}

\begin{tabular}{ll}
where & \(u_{i} \sim \Gaus[0,\tau^2] \)  \\
& \(\varepsilon_{i,t} \sim \Gaus[0,\sigma^2] \) \\
\end{tabular}

\begin{align}
 ICC^{single}_{1,agreement} &= \frac{\tau^2}{\tau^2 + \sigma^2} \\
 ICC^{average}_{1,agreement} &= \frac{\tau^2}{\tau^2 + \frac{\sigma^2}{n}}
\end{align}
#+END_EXPORT

