doc/2018-10-27-ICC/post-ICC.org
** using mixed models
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
lme_ICC1 <- lmer(Y ~ 1 + (1|Id), data = dtL.icc1)

sigma_id <- attr(VarCorr(lme_ICC1)[[1]],"stddev")
sigma_error <- attr(VarCorr(lme_ICC1),"sc")

ICC1.lme <- c(
    single = as.double(sigma_id^2/(sigma_error^2+sigma_id^2)),
    average = as.double(sigma_id^2/(sigma_error^2/n.scan+sigma_id^2))
)

ICC1.lme
#+END_SRC

#+RESULTS:
:    single   average 
: 0.5191614 0.6834842

** using generalized least squares
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
gls_ICC1 <- gls(Y ~ 1, correlation = corCompSymm(form = ~ 1|Id), 
                data = dtL.icc1)

## correlation matrix
unclass(cov2cor(getVarCov(gls_ICC1)))
#+END_SRC

#+RESULTS:
:           [,1]      [,2]
: [1,] 1.0000000 0.5191607
: [2,] 0.5191607 1.0000000

# *** using lvm
# #+BEGIN_SRC R :results output :exports both :session *R* :cache no 
# lvm_ICC1 <- lvm(c(Ytest,Yretest) ~ 0+1*eta)
# covariance(lvm_ICC1, ~Ytest) <- "sigma2" # force same variance
# covariance(lvm_ICC1, ~Yretest) <- "sigma2" # force same variance
# latent(lvm_ICC1) <- ~eta

# elvm_ICC1 <- estimate(lvm_ICC1, data = dtW.data)

# summary(elvm_ICC1)
# #+END_SRC

** using anova
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
aov_ICC1 <- aov(Y ~ Error(Id), data = dtL.icc1) 

MSB <- summary(aov_ICC1)[["Error: Id"]][[1]]["Mean Sq"]
MSW <- summary(aov_ICC1)[["Error: Within"]][[1]]["Mean Sq"]

ICC1.aov <-  c(
    single = as.double((MSB - MSW)/(MSB + (n.scan-1)*MSW)),
    average = as.double((MSB - MSW)/MSB)
)
ICC1.aov
#+END_SRC

#+RESULTS:
:    single   average 
: 0.5191614 0.6834842

** using existing packages
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
tt.single <- c(irr = irr::icc(dfW.icc1[,c("Ytest", "Yretest")],
                              model="oneway", type="consistency")$value,
               psych = psych::ICC(dfW.icc1[,c("Ytest", "Yretest")])[[1]]$ICC[1])

tt.average <- c(irr = irr::icc(dfW.icc1[,c("Ytest", "Yretest")],
                               model="oneway", type="consistency", unit = "average")$value,
                psych = psych::ICC(dfW.icc1[,c("Ytest", "Yretest")])[[1]]$ICC[4])

rbind(single = tt.single, average = tt.average)
#+END_SRC

#+RESULTS:
:               irr     psych
: single  0.5191614 0.5191609
: average 0.6834842 0.6834838

\clearpage

* ICC3: fixed number of sessions accounting for a session effect

Using ICC3, we assess the absolute agreement among measurements
repeated over one random factor (here patient identity) accounting for
a possible session effect. The number of sessions is fixed meaning
that it is precisely those sessions that are interesting.

\bigskip

/Example:/ we want to plan a study (called main study) to assess
treatment efficacy with two sessions: baseline and post-treatment. EEG
is used to measure treatment efficacy. Prior to this study, another
study is performed to assessed the stability of the EEG measurement
between two sessions. Unfortunately the two measurements were not
performed using the same EEG machine so we suspect a systematic
difference in EEG signal between the sessions. The investigator will
make sure that this won't happen in the main study. Therefore the
systematic difference is not inherant to the EEG technic (i.e. won't
be observed in the main study).

\bigskip

/Note:/  In test
re-test analysis this should not be the case since we replicate a
measurement under the same conditions.

\bigskip
\bigskip

Using ICC3, we assess the absolute agreement among measurements
repeated over one random factor account for a possible session
effect. Compared to ICC1, this will lead to:
- a lower \(\sigma^2\) (some of the residual variance is explained)
- a higher \(\tau\) (individual measurements are better correlated since
  there is less arbitrary variation between them)
- a higher ICC

\bigskip

ICC3 is equivalent to the following mixed model:

#+BEGIN_EXPORT latex
\begin{equation}
 Y_{i,t} = \alpha + \beta_t t + u_{i} + \varepsilon_{i,t} 
\end{equation}

\begin{tabular}{ll}
where & \(u_{i} \sim \Gaus[0,\tau^2] \)  \\
& \(t\) is treated as a categorical variable \\
& \(\varepsilon_{i,t} \sim \Gaus[0,\sigma^2] \) \\
\end{tabular}

\begin{align}
 ICC^{single}_{1,agreement} &= \frac{\tau^2}{\tau^2 + \sigma^2} \\
 ICC^{average}_{1,agreement} &= \frac{\tau^2}{\tau^2 + \frac{\sigma^2}{n}}
\end{align}
#+END_EXPORT

\clearpage

** using mixed models
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
lme_ICC2 <- lmer(Y ~ session + (1|Id), data = dtL.icc1)

sigma_id <- attr(VarCorr(lme_ICC2)[[1]],"stddev")
sigma_error <- attr(VarCorr(lme_ICC2),"sc")

ICC2.lme <- c(
    single = as.double(sigma_id^2/(sigma_error^2+sigma_id^2)),
    average = as.double(sigma_id^2/(sigma_error^2/n.scan+sigma_id^2))
)

ICC2.lme
#+END_SRC

#+RESULTS:
:    single   average 
: 0.7495312 0.8568366


** using generalized least squares
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
gls_ICC2 <- gls(Y ~ session, correlation = corCompSymm(form = ~ 1|Id), data = dtL.icc1)

# correlation matrix
unclass(cov2cor(getVarCov(gls_ICC2)))
#+END_SRC

#+RESULTS:
:           [,1]      [,2]
: [1,] 1.0000000 0.7495308
: [2,] 0.7495308 1.0000000


** using anova
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
aov_ICC2 <- aov(Y ~ session + Error(Id), data = dtL.icc1) 

MSB <- summary(aov_ICC2)[["Error: Id"]][[1]]["Mean Sq"]
MSW <- summary(aov_ICC2)[["Error: Within"]][[1]]["Residuals","Mean Sq"]

ICC2.aov <-  c(
    single = as.double((MSB - MSW)/(MSB + (n.scan-1)*MSW)),
    average = as.double((MSB - MSW)/MSB)
)

ICC2.aov
#+END_SRC

#+RESULTS:
:    single   average 
: 0.7495312 0.8568366


** using existing packages
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
# single
cat("single \n")
psych::ICC(dfW.icc1[,c("Ytest", "Yretest")])[[1]]$ICC[3]

# average
cat("average \n")
psych::ICC(dfW.icc1[,c("Ytest", "Yretest")])[[1]]$ICC[6]
#+END_SRC

#+RESULTS:
: single
: [1] 0.7495307
: average
: [1] 0.8568363

* Heterogenous variance between sessions

The previous ICC are not corrected for a possible difference in
variance between sessions:
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
gls_heteroV <- gls(Y ~ session, 
                   weights = varIdent(form = ~ 1|session),
                   correlation = corCompSymm(form = ~ 1|Id), 
                   data = dtL.icc1)

# correlation matrix
unclass(cov2cor(getVarCov(gls_heteroV)))
#+END_SRC

#+RESULTS:
:          [,1]     [,2]
: [1,] 1.000000 0.763223
: [2,] 0.763223 1.000000

In test re-test analysis this should not be the case since we
replicate a measurement under the same conditions.

\clearpage


