doc/2018-10-27-ICC/post-ICC.tex

\subsection{using mixed models}
\label{sec:org2225593}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
lme_ICC1 <- lmer(Y ~ 1 + (1|Id), data = dtL.icc1)

sigma_id <- attr(VarCorr(lme_ICC1)[[1]],"stddev")
sigma_error <- attr(VarCorr(lme_ICC1),"sc")

ICC1.lme <- c(
    single = as.double(sigma_id^2/(sigma_error^2+sigma_id^2)),
    average = as.double(sigma_id^2/(sigma_error^2/n.scan+sigma_id^2))
)

ICC1.lme
\end{lstlisting}

\begin{verbatim}
   single   average 
0.5191614 0.6834842
\end{verbatim}

\subsection{using generalized least squares}
\label{sec:orgce679be}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
gls_ICC1 <- gls(Y ~ 1, correlation = corCompSymm(form = ~ 1|Id), 
		data = dtL.icc1)

## correlation matrix
unclass(cov2cor(getVarCov(gls_ICC1)))
\end{lstlisting}

\begin{verbatim}
          [,1]      [,2]
[1,] 1.0000000 0.5191607
[2,] 0.5191607 1.0000000
\end{verbatim}

\subsection{using anova}
\label{sec:org3a76f51}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
aov_ICC1 <- aov(Y ~ Error(Id), data = dtL.icc1) 

MSB <- summary(aov_ICC1)[["Error: Id"]][[1]]["Mean Sq"]
MSW <- summary(aov_ICC1)[["Error: Within"]][[1]]["Mean Sq"]

ICC1.aov <-  c(
    single = as.double((MSB - MSW)/(MSB + (n.scan-1)*MSW)),
    average = as.double((MSB - MSW)/MSB)
)
ICC1.aov
\end{lstlisting}

\begin{verbatim}
   single   average 
0.5191614 0.6834842
\end{verbatim}

\subsection{using existing packages}
\label{sec:orge0de3a2}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
tt.single <- c(irr = irr::icc(dfW.icc1[,c("Ytest", "Yretest")],
			      model="oneway", type="consistency")$value,
	       psych = psych::ICC(dfW.icc1[,c("Ytest", "Yretest")])[[1]]$ICC[1])

tt.average <- c(irr = irr::icc(dfW.icc1[,c("Ytest", "Yretest")],
			       model="oneway", type="consistency", unit = "average")$value,
		psych = psych::ICC(dfW.icc1[,c("Ytest", "Yretest")])[[1]]$ICC[4])

rbind(single = tt.single, average = tt.average)
\end{lstlisting}

\begin{verbatim}
              irr     psych
single  0.5191614 0.5191609
average 0.6834842 0.6834838
\end{verbatim}

\clearpage

\section{ICC3: fixed number of sessions accounting for a session effect}
\label{sec:org836ea13}

Using ICC3, we assess the absolute agreement among measurements
repeated over one random factor (here patient identity) accounting for
a possible session effect. The number of sessions is fixed meaning
that it is precisely those sessions that are interesting.

\bigskip

\emph{Example:} we want to plan a study (called main study) to assess
treatment efficacy with two sessions: baseline and post-treatment. EEG
is used to measure treatment efficacy. Prior to this study, another
study is performed to assessed the stability of the EEG measurement
between two sessions. Unfortunately the two measurements were not
performed using the same EEG machine so we suspect a systematic
difference in EEG signal between the sessions. The investigator will
make sure that this won't happen in the main study. Therefore the
systematic difference is not inherant to the EEG technic (i.e. won't
be observed in the main study).

\bigskip

\emph{Note:}  In test
re-test analysis this should not be the case since we replicate a
measurement under the same conditions.

\bigskip
\bigskip

Using ICC3, we assess the absolute agreement among measurements
repeated over one random factor account for a possible session
effect. Compared to ICC1, this will lead to:
\begin{itemize}
\item a lower \(\sigma^2\) (some of the residual variance is explained)
\item a higher \(\tau\) (individual measurements are better correlated since
there is less arbitrary variation between them)
\item a higher ICC
\end{itemize}

\bigskip

ICC3 is equivalent to the following mixed model:

\begin{equation}
 Y_{i,t} = \alpha + \beta_t t + u_{i} + \varepsilon_{i,t} 
\end{equation}

\begin{tabular}{ll}
where & \(u_{i} \sim \Gaus[0,\tau^2] \)  \\
& \(t\) is treated as a categorical variable \\
& \(\varepsilon_{i,t} \sim \Gaus[0,\sigma^2] \) \\
\end{tabular}

\begin{align}
 ICC^{single}_{1,agreement} &= \frac{\tau^2}{\tau^2 + \sigma^2} \\
 ICC^{average}_{1,agreement} &= \frac{\tau^2}{\tau^2 + \frac{\sigma^2}{n}}
\end{align}

\clearpage

\subsection{using mixed models}
\label{sec:org20de13e}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
lme_ICC2 <- lmer(Y ~ session + (1|Id), data = dtL.icc1)

sigma_id <- attr(VarCorr(lme_ICC2)[[1]],"stddev")
sigma_error <- attr(VarCorr(lme_ICC2),"sc")

ICC2.lme <- c(
    single = as.double(sigma_id^2/(sigma_error^2+sigma_id^2)),
    average = as.double(sigma_id^2/(sigma_error^2/n.scan+sigma_id^2))
)

ICC2.lme
\end{lstlisting}

\begin{verbatim}
   single   average 
0.7495312 0.8568366
\end{verbatim}


\subsection{using generalized least squares}
\label{sec:org18b2737}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
gls_ICC2 <- gls(Y ~ session, correlation = corCompSymm(form = ~ 1|Id), data = dtL.icc1)

# correlation matrix
unclass(cov2cor(getVarCov(gls_ICC2)))
\end{lstlisting}

\begin{verbatim}
          [,1]      [,2]
[1,] 1.0000000 0.7495308
[2,] 0.7495308 1.0000000
\end{verbatim}


\subsection{using anova}
\label{sec:org7fc92bc}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
aov_ICC2 <- aov(Y ~ session + Error(Id), data = dtL.icc1) 

MSB <- summary(aov_ICC2)[["Error: Id"]][[1]]["Mean Sq"]
MSW <- summary(aov_ICC2)[["Error: Within"]][[1]]["Residuals","Mean Sq"]

ICC2.aov <-  c(
    single = as.double((MSB - MSW)/(MSB + (n.scan-1)*MSW)),
    average = as.double((MSB - MSW)/MSB)
)

ICC2.aov
\end{lstlisting}

\begin{verbatim}
   single   average 
0.7495312 0.8568366
\end{verbatim}


\subsection{using existing packages}
\label{sec:org3c1fbf4}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
# single
cat("single \n")
psych::ICC(dfW.icc1[,c("Ytest", "Yretest")])[[1]]$ICC[3]

# average
cat("average \n")
psych::ICC(dfW.icc1[,c("Ytest", "Yretest")])[[1]]$ICC[6]
\end{lstlisting}

\begin{verbatim}
single
[1] 0.7495307
average
[1] 0.8568363
\end{verbatim}

\section{Heterogenous variance between sessions}
\label{sec:orgac12914}

The previous ICC are not corrected for a possible difference in
variance between sessions:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
gls_heteroV <- gls(Y ~ session, 
		   weights = varIdent(form = ~ 1|session),
		   correlation = corCompSymm(form = ~ 1|Id), 
		   data = dtL.icc1)

# correlation matrix
unclass(cov2cor(getVarCov(gls_heteroV)))
\end{lstlisting}

\begin{verbatim}
         [,1]     [,2]
[1,] 1.000000 0.763223
[2,] 0.763223 1.000000
\end{verbatim}

In test re-test analysis this should not be the case since we
replicate a measurement under the same conditions.

\clearpage
