doc/2018-10-27-ICC/post-ICC.org
* ICC2: random number of sessions

Using ICC2, we assess the absolute agreement among measurements
repeated over two random factors, e.g. patient identity and
sessions. We don't account for a possible session effect. The number
of sessions is random meaning that we are not precisely interested in
those sessions. A more realistic example would be to consider raters
instead of sessions.

\bigskip

/Example:/ we want to study the reliability of the grades given by
teachers. We include 10 teachers that will grade 20 students. We are
not interested in those specific teachers since further studies may be
performed in other schools with other teachers.

\bigskip

ICC2 is equivalent to the following mixed model:
#+BEGIN_EXPORT latex
\begin{equation}
Y_{i,j,t} = \alpha + u_{i} + v_{j} + \varepsilon_{i,j,t}
\end{equation}

\begin{tabular}{ll}
where & \(u_{i} \sim \Gaus[0,\tau^2] \) \\
 &  \(v_{j} \sim \Gaus[0,\delta^2] \) \\
 & \(\varepsilon_{i,t} \sim \Gaus[0,\sigma^2] \) \\
\end{tabular}
#+END_EXPORT

#+BEGIN_EXPORT latex
\begin{align}
 ICC_{2,agreement} &= \frac{\tau^2}{\tau^2 + \sigma^2} \text{ or } ICC_{2,consistency} = \frac{\tau^2}{\tau^2 + \delta^2 + \sigma^2} \\
 ICC^{average}_{2,agreement} &= \frac{\tau^2}{\tau^2 + \frac{\sigma^2}{n}} \text{ or } ICC^{average}_{2,consistency} = \frac{\tau^2}{\tau^2 + \frac{1}{n}(\delta^2 + \sigma^2)}
\end{align}
#+END_EXPORT


** using mixed models
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
lme_ICC2r <- lmer(Y ~ 1 + (1|session)+ (1|Id), data = dtL.icc2)

sigma_id <- attr(VarCorr(lme_ICC2r)[[1]],"stddev")
sigma_scan <- attr(VarCorr(lme_ICC2r)[[2]],"stddev")
sigma_error <- attr(VarCorr(lme_ICC2r),"sc")

ICC2r.lme <- c(
    consistency.single = as.double(sigma_id^2/(sigma_error^2+sigma_id^2)),
    agreement.single = as.double(sigma_id^2/(sigma_error^2+sigma_scan^2+sigma_id^2)),
    consistency.average = as.double(sigma_id^2/(sigma_error^2/n.rater+sigma_id^2)),
    agreement.average = as.double(sigma_id^2/(sigma_error^2/n.rater+sigma_scan^2/n.rater+sigma_id^2))
)
ICC2r.lme
#+END_SRC

#+RESULTS:
:  consistency.single    agreement.single consistency.average   agreement.average 
:           0.8057243           0.8001868           0.9539947           0.9524339

\clearpage

** using generalized least squares
Don't know how to specify non-nested random effects

** using anova
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
aov_ICC2r <- aov(Y ~ Error(session + Id), data = dtL.icc2) 

MSB <- summary(aov_ICC2r)[["Error: Id"]][[1]]["Mean Sq"]
MSscan <- summary(aov_ICC2r)[["Error: session"]][[1]]["Residuals","Mean Sq"]
MSW <- summary(aov_ICC2r)[["Error: Within"]][[1]]["Residuals","Mean Sq"]

ICC2r.aov <-  c(
    consistency.single = as.double((MSB - MSW)/(MSB + (n.rater-1)*MSW)),
    agreement.single = as.double((MSB - MSW)/(MSB + (n.rater-1)*MSW + n.rater * (MSscan-MSW)/n.id)),
    consistency.average = as.double((MSB - MSW)/MSB),
    agreement.average = as.double((MSB - MSW)/(MSB + (MSscan-MSW)/n.id))
)
ICC2r.aov
#+END_SRC

#+RESULTS:
:  consistency.single    agreement.single consistency.average   agreement.average 
:           0.8057232           0.8001849           0.9539944           0.9524334

** using existing packages
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
tt.single <- c(
    iccC = irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
                    model="twoway", type="consistency")$value,
    irrA = irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
                    model="twoway", type="agreement")$value,
    psych = psych::ICC(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")])[[1]]$ICC[3:2]
)

tt.average <- c(
    iccC = irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
                    model="twoway", type="consistency", unit = "average")$value,
    iccA = irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
                    model="twoway", type="agreement", unit = "average")$value,
    psych = psych::ICC(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")])[[1]]$ICC[6:5]
)
rbind(single = tt.single, average = tt.average)
#+END_SRC

#+RESULTS:
:              iccC      irrA    psych1    psych2
: single  0.8057232 0.8001849 0.8057243 0.8001868
: average 0.9539944 0.9524334 0.9539947 0.9524339

\clearpage

* Different correlation between sessions

When considering more than 2 sessions, the previous ICC assume the
same correlation between sessions (or raters). This can be relaxed
using an unstructured covariance matrix:

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
gls_heteroC <- gls(Y ~ session,
                   correlation = corSymm(form = ~ 1|Id),
                   data = dtL.icc2)

# correlation matrix
M.icc <- unclass(cov2cor(getVarCov(gls_heteroC)))
print(M.icc)
#+END_SRC

#+RESULTS:
:           [,1]      [,2]      [,3]      [,4]      [,5]
: [1,] 1.0000000 0.8257161 0.6932362 0.8742870 0.7906416
: [2,] 0.8257161 1.0000000 0.7640218 0.7507233 0.8421197
: [3,] 0.6932362 0.7640218 1.0000000 0.5166736 0.6906414
: [4,] 0.8742870 0.7507233 0.5166736 1.0000000 0.5647855
: [5,] 0.7906416 0.8421197 0.6906414 0.5647855 1.0000000

Note that the mean ICC:
#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
c(mean = mean(setdiff(unique(M.icc),1)), 
  indiv = apply(M.icc, 1, function(x){mean(setdiff(x,1))}))
#+END_SRC

#+RESULTS:
:      mean    indiv1    indiv2    indiv3    indiv4    indiv5 
: 0.7312846 0.7959702 0.7956452 0.6661432 0.6766173 0.7220470

does not match the "normal" ICC:
#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R :exports both :results output :session *R* :cache yes 
gls_homoC <- gls(Y ~ session,
                 correlation = corCompSymm(form = ~ 1|Id),
                 data = dtL.icc2)

# correlation matrix
unclass(cov2cor(getVarCov(gls_homoC)))
#+END_SRC

#+RESULTS[<2021-03-08 10:55:11> 790b9e6b10bda97286ac92c45cde0ea1910b03f5]:
:           [,1]      [,2]      [,3]      [,4]      [,5]
: [1,] 1.0000000 0.8057232 0.8057232 0.8057232 0.8057232
: [2,] 0.8057232 1.0000000 0.8057232 0.8057232 0.8057232
: [3,] 0.8057232 0.8057232 1.0000000 0.8057232 0.8057232
: [4,] 0.8057232 0.8057232 0.8057232 1.0000000 0.8057232
: [5,] 0.8057232 0.8057232 0.8057232 0.8057232 1.0000000

\clearpage

/Note:/ small difference between the function =icc= and
=gls=. Due to non optimal optimization in =gls=?

#+BEGIN_SRC R :exports both :results output :session *R* :cache yes 
irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
         model="oneway", type="consistency")$value
#+END_SRC

#+RESULTS[<2017-07-01 21:49:04> b5b0d239f1cdc28f670b3bc9b94e79eb87657c71]:
: [1] 0.7999099


* CONFIG :noexport:
#+LANGUAGE:  en
#+LaTeX_CLASS: org-article
#+LaTeX_CLASS_OPTIONS: [12pt]
#+OPTIONS:   title:t author:t toc:nil todo:nil
#+OPTIONS:   H:3 num:t 
#+OPTIONS:   TeX:t LaTeX:t

** Display of the document
# ## space between lines
#+LATEX_HEADER: \RequirePackage{setspace} % to modify the space between lines - incompatible with footnote in beamer
#+LaTeX_HEADER:\renewcommand{\baselinestretch}{1.1}

# ## margins
#+LATEX_HEADER:\geometry{top=1cm}

# ## personalize the prefix in the name of the sections
#+LaTeX_HEADER: \usepackage{titlesec}
# ## fix bug in titlesec version
# ##  https://tex.stackexchange.com/questions/299969/titlesec-loss-of-section-numbering-with-the-new-update-2016-03-15
#+LaTeX_HEADER: \usepackage{etoolbox}
#+LaTeX_HEADER: 
#+LaTeX_HEADER: \makeatletter
#+LaTeX_HEADER: \patchcmd{\ttlh@hang}{\parindent\z@}{\parindent\z@\leavevmode}{}{}
#+LaTeX_HEADER: \patchcmd{\ttlh@hang}{\noindent}{}{}{}
#+LaTeX_HEADER: \makeatother

** Color
# ## define new colors
#+LATEX_HEADER: \RequirePackage{colortbl} % arrayrulecolor to mix colors
#+LaTeX_HEADER: \definecolor{myorange}{rgb}{1,0.2,0}
#+LaTeX_HEADER: \definecolor{mypurple}{rgb}{0.7,0,8}
#+LaTeX_HEADER: \definecolor{mycyan}{rgb}{0,0.6,0.6}
#+LaTeX_HEADER: \newcommand{\lightblue}{blue!50!white}
#+LaTeX_HEADER: \newcommand{\darkblue}{blue!80!black}
#+LaTeX_HEADER: \newcommand{\darkgreen}{green!50!black}
#+LaTeX_HEADER: \newcommand{\darkred}{red!50!black}
#+LaTeX_HEADER: \definecolor{gray}{gray}{0.5}

# ## change the color of the links
#+LaTeX_HEADER: \hypersetup{
#+LaTeX_HEADER:  citecolor=[rgb]{0,0.5,0},
#+LaTeX_HEADER:  urlcolor=[rgb]{0,0,0.5},
#+LaTeX_HEADER:  linkcolor=[rgb]{0,0,0.5},
#+LaTeX_HEADER: }

** Font
# https://tex.stackexchange.com/questions/25249/how-do-i-use-a-particular-font-for-a-small-section-of-text-in-my-document
#+LaTeX_HEADER: \newenvironment{comment}{\small \color{gray}\fontfamily{lmtt}\selectfont}{\par}
#+LaTeX_HEADER: \newenvironment{activity}{\color{orange}\fontfamily{qzc}\selectfont}{\par}

