doc/2018-10-27-ICC/post-ICC.tex


\section{ICC2: random number of sessions}
\label{sec:org1b8d2d6}

Using ICC2, we assess the absolute agreement among measurements
repeated over two random factors, e.g. patient identity and
sessions. We don't account for a possible session effect. The number
of sessions is random meaning that we are not precisely interested in
those sessions. A more realistic example would be to consider raters
instead of sessions.

\bigskip

\emph{Example:} we want to study the reliability of the grades given by
teachers. We include 10 teachers that will grade 20 students. We are
not interested in those specific teachers since further studies may be
performed in other schools with other teachers.

\bigskip

ICC2 is equivalent to the following mixed model:
\begin{equation}
Y_{i,j,t} = \alpha + u_{i} + v_{j} + \varepsilon_{i,j,t}
\end{equation}

\begin{tabular}{ll}
where & \(u_{i} \sim \Gaus[0,\tau^2] \) \\
 &  \(v_{j} \sim \Gaus[0,\delta^2] \) \\
 & \(\varepsilon_{i,t} \sim \Gaus[0,\sigma^2] \) \\
\end{tabular}

\begin{align}
 ICC_{2,agreement} &= \frac{\tau^2}{\tau^2 + \sigma^2} \text{ or } ICC_{2,consistency} = \frac{\tau^2}{\tau^2 + \delta^2 + \sigma^2} \\
 ICC^{average}_{2,agreement} &= \frac{\tau^2}{\tau^2 + \frac{\sigma^2}{n}} \text{ or } ICC^{average}_{2,consistency} = \frac{\tau^2}{\tau^2 + \frac{1}{n}(\delta^2 + \sigma^2)}
\end{align}


\subsection{using mixed models}
\label{sec:org5be25e1}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
lme_ICC2r <- lmer(Y ~ 1 + (1|session)+ (1|Id), data = dtL.icc2)

sigma_id <- attr(VarCorr(lme_ICC2r)[[1]],"stddev")
sigma_scan <- attr(VarCorr(lme_ICC2r)[[2]],"stddev")
sigma_error <- attr(VarCorr(lme_ICC2r),"sc")

ICC2r.lme <- c(
    consistency.single = as.double(sigma_id^2/(sigma_error^2+sigma_id^2)),
    agreement.single = as.double(sigma_id^2/(sigma_error^2+sigma_scan^2+sigma_id^2)),
    consistency.average = as.double(sigma_id^2/(sigma_error^2/n.rater+sigma_id^2)),
    agreement.average = as.double(sigma_id^2/(sigma_error^2/n.rater+sigma_scan^2/n.rater+sigma_id^2))
)
ICC2r.lme
\end{lstlisting}

\begin{verbatim}
consistency.single    agreement.single consistency.average   agreement.average 
         0.8057243           0.8001868           0.9539947           0.9524339
\end{verbatim}

\clearpage

\subsection{using generalized least squares}
\label{sec:org18a1437}
Don't know how to specify non-nested random effects

\subsection{using anova}
\label{sec:orgf330dea}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
aov_ICC2r <- aov(Y ~ Error(session + Id), data = dtL.icc2) 

MSB <- summary(aov_ICC2r)[["Error: Id"]][[1]]["Mean Sq"]
MSscan <- summary(aov_ICC2r)[["Error: session"]][[1]]["Residuals","Mean Sq"]
MSW <- summary(aov_ICC2r)[["Error: Within"]][[1]]["Residuals","Mean Sq"]

ICC2r.aov <-  c(
    consistency.single = as.double((MSB - MSW)/(MSB + (n.rater-1)*MSW)),
    agreement.single = as.double((MSB - MSW)/(MSB + (n.rater-1)*MSW + n.rater * (MSscan-MSW)/n.id)),
    consistency.average = as.double((MSB - MSW)/MSB),
    agreement.average = as.double((MSB - MSW)/(MSB + (MSscan-MSW)/n.id))
)
ICC2r.aov
\end{lstlisting}

\begin{verbatim}
consistency.single    agreement.single consistency.average   agreement.average 
         0.8057232           0.8001849           0.9539944           0.9524334
\end{verbatim}

\subsection{using existing packages}
\label{sec:orgae24fdf}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
tt.single <- c(
    iccC = irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
		    model="twoway", type="consistency")$value,
    irrA = irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
		    model="twoway", type="agreement")$value,
    psych = psych::ICC(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")])[[1]]$ICC[3:2]
)

tt.average <- c(
    iccC = irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
		    model="twoway", type="consistency", unit = "average")$value,
    iccA = irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
		    model="twoway", type="agreement", unit = "average")$value,
    psych = psych::ICC(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")])[[1]]$ICC[6:5]
)
rbind(single = tt.single, average = tt.average)
\end{lstlisting}

\begin{verbatim}
             iccC      irrA    psych1    psych2
single  0.8057232 0.8001849 0.8057243 0.8001868
average 0.9539944 0.9524334 0.9539947 0.9524339
\end{verbatim}

\clearpage

\section{Different correlation between sessions}
\label{sec:orgd8b384c}

When considering more than 2 sessions, the previous ICC assume the
same correlation between sessions (or raters). This can be relaxed
using an unstructured covariance matrix:

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none,otherkeywords={}, deletekeywords={}}
\begin{lstlisting}
gls_heteroC <- gls(Y ~ session,
		   correlation = corSymm(form = ~ 1|Id),
		   data = dtL.icc2)

# correlation matrix
M.icc <- unclass(cov2cor(getVarCov(gls_heteroC)))
print(M.icc)
\end{lstlisting}

\begin{verbatim}
          [,1]      [,2]      [,3]      [,4]      [,5]
[1,] 1.0000000 0.8257161 0.6932362 0.8742870 0.7906416
[2,] 0.8257161 1.0000000 0.7640218 0.7507233 0.8421197
[3,] 0.6932362 0.7640218 1.0000000 0.5166736 0.6906414
[4,] 0.8742870 0.7507233 0.5166736 1.0000000 0.5647855
[5,] 0.7906416 0.8421197 0.6906414 0.5647855 1.0000000
\end{verbatim}

Note that the mean ICC:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none,otherkeywords={}, deletekeywords={}}
\begin{lstlisting}
c(mean = mean(setdiff(unique(M.icc),1)), 
  indiv = apply(M.icc, 1, function(x){mean(setdiff(x,1))}))
\end{lstlisting}

\begin{verbatim}
     mean    indiv1    indiv2    indiv3    indiv4    indiv5 
0.7312846 0.7959702 0.7956452 0.6661432 0.6766173 0.7220470
\end{verbatim}

does not match the "normal" ICC:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none,otherkeywords={}, deletekeywords={}}
\begin{lstlisting}
gls_homoC <- gls(Y ~ session,
		 correlation = corCompSymm(form = ~ 1|Id),
		 data = dtL.icc2)

# correlation matrix
unclass(cov2cor(getVarCov(gls_homoC)))
\end{lstlisting}

\begin{verbatim}
          [,1]      [,2]      [,3]      [,4]      [,5]
[1,] 1.0000000 0.8057232 0.8057232 0.8057232 0.8057232
[2,] 0.8057232 1.0000000 0.8057232 0.8057232 0.8057232
[3,] 0.8057232 0.8057232 1.0000000 0.8057232 0.8057232
[4,] 0.8057232 0.8057232 0.8057232 1.0000000 0.8057232
[5,] 0.8057232 0.8057232 0.8057232 0.8057232 1.0000000
\end{verbatim}

\clearpage

\emph{Note:} small difference between the function \texttt{icc} and
\texttt{gls}. Due to non optimal optimization in \texttt{gls}?

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
	 model="oneway", type="consistency")$value
\end{lstlisting}

\begin{verbatim}
[1] 0.7999099
\end{verbatim}
\end{document}